{
  "alora_invocation_tokens": null,
  "alpha_pattern": {},
  "arrow_config": null,
  "auto_mapping": {
    "base_model_class": "GLiNER2",
    "parent_library": "gliner2.inference.engine"
  },
  "base_model_name_or_path": "artifacts/models/fastino_gliner2_large_v1",
  "bias": "none",
  "corda_config": null,
  "ensure_weight_tying": false,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 8.0,
  "lora_bias": false,
  "lora_dropout": 0.05,
  "lora_ga_config": null,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "peft_version": "0.19.1",
  "qalora_group_size": 16,
  "r": 4,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "count_pred.2",
    "classifier.0",
    "span_rep.span_rep_layer.project_end.0",
    "count_embed.projector.0",
    "span_rep.span_rep_layer.project_start.0",
    "count_embed.projector.2",
    "span_rep.span_rep_layer.project_end.3",
    "span_rep.span_rep_layer.project_start.3",
    "classifier.2",
    "count_pred.0",
    "span_rep.span_rep_layer.out_project.0",
    "span_rep.span_rep_layer.out_project.3"
  ],
  "target_parameters": null,
  "task_type": null,
  "trainable_token_indices": null,
  "use_bdlora": null,
  "use_dora": false,
  "use_qalora": false,
  "use_rslora": false
}